from matplotlib import pyplot as plt

##Άξονας X, οι ηλικίες των εργαζομένων
ages_x = [25, 26, 27, 28, 29, 30, 31, 32, 33, 34, 35]

##Άξονας Υ, ο μέσος μισθός των εργαζομένων
dev_y = [38496, 42000, 46752, 49320, 53200,
         56000, 62316, 64928, 67317, 68748, 73752]


##Δημιουργούμε γραμμή με τα δεδομένα
plt.plot(ages_x,dev_y)

py_dev_y = [45372, 48876, 53850, 57287, 63016,
            65998, 70003, 70000, 71496, 75370, 83640]


plt.plot(ages_x,py_dev_y)

##Όνομα για άξονα Χ
plt.xlabel('Ages')

##Όνομα για άξονα Υ
plt.ylabel('Median Salary')

##Τίτλος
plt.title('Median salary by Age')

plt.show()